Repository: pyvista/pyvista-doc-translations
Catalog: locale/*/LC_MESSAGES/authors.po
Languages: uk, zh_tw

source: Authors & Citation
uk: Автори та цитування
zh_tw: 作者&引用

source: PyVista is an open-source project with a community of contributors. While most of PyVista's contributors are listed in the :ref:`authors_ref` section, please be sure to head over to the `Contributors Graph`_.
uk: PyVista це проєкт з відкритим початковим кодом та спільнотою співавторів. Хоча більшість співавторів PyVista перерахована в розділі :ref:`authors_ref`, будь-ласка, обов'язково загляньте до `Contributors Graph`_.
zh_tw: PyVista 是一个开源项目，拥有一个贡献者社区。 虽然 PyVista 的大部分贡献者都列在了 :ref:`authors_ref` 部分，但请务必前往 `Contributors Graph`_。

source: Citing PyVista
uk: Цитування PyVista
zh_tw: 引用 PyVista

source: There is a `paper about PyVista <https://doi.org/10.21105/joss.01450>`_!
uk: `Стаття про PyVista <https://doi.org/10.21105/joss.01450>`_!
zh_tw: 這是關於 PyVista 的論文： <https://doi.org/10.21105/joss.01450>`_!

source: If you are using PyVista in your scientific research, please help our scientific visibility by citing our work!
uk: Якщо Ви використовуєте PyVista в своїх наукових дослідженнях, будь-ласка, допоможіть нашій науковій видимості цитуванням нашої роботи!
zh_tw: 如果您在科学研究中使用 PyVista，请通过引用我们的工作来帮助我们提高科学知名度！

source: Authors
uk: Автори
zh_tw: 作者

source: The following is a list of authors who have made substantial contributions to the conception or design of this software; or the creation of new code used in this software; or have drafted the work or substantively revised it and are considered "The PyVista Developers":
uk: Нижче наведений список авторів, які внесли значний вклад в розробку концепції чи проектування цього програмного забезпечення; чи створення нового коду, який використовується в цьому програмному забезпеченні; чи склали проєкт роботи чи істотно перевірили його і вважаються "Розробниками PyVista":
zh_tw: 以下是对本软件的概念或设计做出重大贡献的作者名单；他们或撰写了本软件中使用的新代码； 或已参与起草本工作或对其进行实质性修改并被视为“PyVista 开发人员”：

source: License
uk: Ліцензія
zh_tw: 授權條款

source: The MIT License
uk: Ліцензія MIT
zh_tw: MIT 授權條款

source: Copyright (c) 2017-2021 The PyVista Developers
uk: Авторські права (c) 2017-2021 Розробники PyVista
zh_tw: Copyright (c) 2017-2021 PyVista 開發者所有

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
uk: Справжнім дозволяється, безоплатно, будь-якій особі, що отримала копію цього програмного забезпечення та супутньої документації (в подальшому "Програмне забезпечення"), використовувати Програмне забезпечення без обмежень, зокрема без обмежень, прав на використання, копіювання, змінювання, доповнення, публікацію, поширення, субліцензування та / або продаж копій Програмного забезпечення, також як і особам, яким надається це Програмне забезпечення, за дотримання наступних умов:
zh_tw: 特此授予任何人免费获得本软件和相关文档文件（“软件”）副本的许可，不受限制地处理本软件，包括但不限于使用、复制、修改、合并的权利 、发布、分发、再许可和/或销售本软件的副本，并允许向其提供本软件的人员这样做，但须符合以下条件：

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
uk: Вищезгадані авторські права та ці умови мають бути включені в усі копії або значущі частини цього Програмного забезпечення.
zh_tw: 上述版权声明和本许可声明应包含在软件的所有副本或重要部分中。

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
uk: ДІЙСНЕ ПРОГРАМНЕ ЗАБЕЗПЕЧЕННЯ НАДАЄТЬСЯ «ЯК Є», БЕЗ ГАРАНТІЙ БУДЬ-ЯКОГО ВИДУ, ПРЯМИХ АБО НЕПРЯМИХ, ВКЛЮЧАЮЧИ, АЛЕ НЕ ОБМЕЖУЮЧИСЬ, ГАРАНТІЯМИ КОМЕРЦІЙНОЇ ВИГОДИ, ВІДПОВІДНОСТІ ЙОГО КОНКРЕТНОМУ ПРИЗНАЧЕННЮ Й ВІДСУТНОСТІ ПОРУШЕННЯ ПРАВ. У ЖОДНОМУ РАЗІ АВТОРИ АБО ВЛАСНИКИ АВТОРСЬКИХ ПРАВ НЕ ВІДПОВІДАЮТЬ ЗА БУДЬ-ЯКИМИ СУДОВИМИ ПОЗОВАМИ, ЩОДО ЗБИТКІВ АБО ІНШИХ ПРЕТЕНЗІЙ, ЧИ ДІЙ ДОГОВОРУ, ЦИВІЛЬНОГО ПРАВОПОРУШЕННЯ АБО ІНШИХ, ЩО ВИНИКАЮТЬ ПОЗА, АБО У ЗВ'ЯЗКУ З ПРОГРАМНИМ ЗАБЕЗПЕЧЕННЯМ АБО ВИКОРИСТАННЯМ ЧИ ІНШИМИ ДІЯМИ ПРОГРАМНОГО ЗАБЕЗПЕЧЕННЯ.
zh_tw: 该软件“按原样”提供，不提供任何形式的明示或暗示的保证，包括但不限于适销性、特定用途的适用性和不侵权的保证。在任何情况下，作者或版权持有人均不对任何索赔、损害或其他责任承担任何责任，无论是由软件或软件的使用、或其他原因引起的或与之相关的合同、诉讼、侵权行为或其他方面。
