Repository: pyvista/pyvista-doc-translations
Catalog: locale/*/LC_MESSAGES/external_examples.po
Languages: uk

source: Atmospheric Convection
uk: Атмосферна конвекція

source: Damavand Volcano
uk: Вулкан Дамаванд

source: Optimization visualization with PyVista
uk: Візуалізація оптимізації за допомогою PyVista

source: Orvisu Demo Application
uk: Демо-додаток Orvisu

source: PyMeshFix's example gallery
uk: Галерея прикладів PyMeshFix

source: TetGen's example gallery
uk: Галерея прикладів TetGen

source: PVGeo's example gallery
uk: Галерея прикладів PVGeo

source: FORGE Geothermal Project
uk: Геотермальний проєкт FORGE

source: OpenFOAM Rendering
uk: Рендерінг OpenFOAM

source: 3D Rendering with Discretize
uk: 3D-рендерінг за допомогою Discretize

source: 3D visualization for the Open Mining Format (omf)
uk: 3D-візуалізація для Open Mining Format (omf)

source: External Examples
uk: Зовнішні приклади

source: Here are a list of longer, more technical examples of what PyVista can do!
uk: Ось список довших, більш технічних прикладів того, що може робити PyVista!

source: Please note that these examples link to external websites. If any of these links are broken, please raise an issue on the repository.
uk: Зверніть увагу, що ці приклади посилаються на зовнішні веб-сайти. Якщо якесь з цих посилань непрацююче, будь-ласка, підніміть питання в репозиторії.

source: Do you have a technical processing workflow or visualization routine you would like to share? If so, please consider sharing your work here submitting a PR at https://github.com/pyvista and we would be glad to add it!
uk: У Вас є робочий процес технічної обробки чи процедура візуалізації, якої Ви б хотіли поділитися? Якщо так, будь ласка, розгляньте можливість поділитися своєю роботою тут, надіславши PR на https://github.com/pyvista, і ми будемо раді додати його!

source: <div class="sphx-glr-thumbcontainer" tooltip="Visualize 3D models of Damavand Volcano, Alborz, Iran.">
uk: <div class="sphx-glr-thumbcontainer" tooltip="Візуалізуйте 3D-моделі вулкану Дамаванд, Альборз, Іран.">

source: <div class="sphx-glr-thumbcontainer" tooltip="Optimization visualization with PyVista">
uk: <div class="sphx-glr-thumbcontainer" tooltip="Візуалізація оптимізації за допомогою PyVista">

source: <div class="sphx-glr-thumbcontainer" tooltip="Orvisu Demo Application">
uk: <div class="sphx-glr-thumbcontainer" tooltip="Демо-додаток Orvisu">

source: <div class="sphx-glr-thumbcontainer" tooltip="PyMeshFix's example gallery">
uk: <div class="sphx-glr-thumbcontainer" tooltip="Галерея прикладів PyMeshFix">

source: <div class="sphx-glr-thumbcontainer" tooltip="TetGen's example gallery">
uk: <div class="sphx-glr-thumbcontainer" tooltip="Галерея прикладів TetGen">

source: <div class="sphx-glr-thumbcontainer" tooltip="PVGeo's example gallery">
uk: <div class="sphx-glr-thumbcontainer" tooltip="Галерея прикладів PVGeo">

source: <div class="sphx-glr-thumbcontainer" tooltip="FORGE Geothermal Project">
uk: <div class="sphx-glr-thumbcontainer" tooltip="Геотермальний проєкт FORGE">

source: <div class="sphx-glr-thumbcontainer" tooltip="OpenFOAM Rendering">
uk: <div class="sphx-glr-thumbcontainer" tooltip="Рендерінг OpenFOAM">

source: <div class="sphx-glr-thumbcontainer" tooltip="3D Rendering with Discretize">
uk: <div class="sphx-glr-thumbcontainer" tooltip="3D-рендерінг за допомогою Discretize">

source: <div class="sphx-glr-thumbcontainer" tooltip="3D visualization for the Open Mining Format (omf)">
uk: <div class="sphx-glr-thumbcontainer" tooltip="3D візуалізація для Open Mining Format (omf)">
