Repository: pyvista/pyvista-doc-translations
Catalog: locale/*/LC_MESSAGES/why.po
Languages: ja, uk

source: Why PyVista?
ja: なぜPyVistaなのか?
uk: Чому PyVista?

source: VTK is an excellent visualization toolkit, and with Python bindings it should be able to combine the speed of C++ with the rapid prototyping of Python. However, despite this VTK code programmed in Python generally looks the same as its C++ counterpart. This module seeks to simplify mesh creation and plotting without losing functionality.
ja: VTKは優れた視覚化ツールキットであり，Pythonバインディングを使えば，C++のスピードとPythonのラピッドプロトタイピングを組み合わせることができるはずです．ただし，PythonでプログラムされたこのVTKコードは，一般的には対応するC++と同じように見えます．このモジュールは，機能を損なうことなくメッシュの作成とプロットを簡略化することを目的としています．
uk: VTK - це чудовий інструментарій візуалізації, і з прив’язками до Python він повинен мати можливість поєднувати швидкість C++ із швидким прототипуванням Python. Однак, незважаючи на це, код VTK, запрограмований на Python, загалом виглядає так само, як і його аналог на C++. Цей модуль має на меті спростити створення та побудову сітки без втрати функціональності.

source: Compare two approaches for loading and plotting a surface mesh from a file:
ja: ファイルから表面メッシュをロードおよびプロットする2つの方法を比較します:
uk: Порівняйте два підходи до завантаження та побудови сітки поверхні з файлу:

source: Plotting a Mesh using Python's VTK
ja: PythonのVTKを使用したメッシュのプロット
uk: Побудова сітки за допомогою VTK Python

source: Using this `example <http://www.vtk.org/Wiki/VTK/Examples/Python/STLReader>`_, loading and plotting an STL file requires a lot of code when using only the ``vtk`` module.
ja: この `example <http://www.vtk.org/Wiki/VTK/Examples/Python/STLReader>`_ を使用してSTLファイルのロードとプロットを行う場合， ``vtk`` モジュールだけを使用すると大量のコードが必要になります．
uk: Використовуючи цей `приклад<http://www.vtk.org/Wiki/VTK/Examples/Python/STLReader>`_, завантаження та побудова STL-файлу потребує багато коду, використовуючи лише ``vtk`` модуль.

source: Plot a Mesh using PyVista
ja: PyVistaを使用してメッシュをプロットする
uk: Побудова сітки за допомогою PyVista

source: The same stl can be loaded and plotted using pyvista with:
ja: pyvistaを使用して，同じstlをロードしたりプロットすることができます:
uk: Той самий STL можна завантажити та побудувати за допомогою pyvista:

source: The mesh object is more pythonic and the code is much more straightforward. Garbage collection is taken care of automatically and the renderer is cleaned up after the user closes the VTK plotting window.
ja: メッシュオブジェクトはよりPython的で，コードはずっと単純です．ガベージコレクションは自動的に処理され，ユーザがVTKプロットウィンドウを閉じた後にレンダラはクリーンアップされます．
uk: Об’єкт сітки є більш пітонічним, а код набагато простішим. Збирання сміття виконується автоматично, а рендерер очищається після того, як користувач закриє вікно побудови VTK.

source: Advanced Plotting with Numpy
ja: Numpyを使用した高度なプロット
uk: Прогресивна побудова за допомогою Numpy

source: When combined with numpy, you can make some truly spectacular plots:
ja: numpyと組み合わせると，本当に素晴らしいプロットができます:
uk: У поєднанні з numpy Ви можете створити справді вражаючі зображення:

source: While not everything can be simplified without losing functionality, many of the objects can. For example, triangular surface meshes in VTK can be subdivided but every other object in VTK cannot. It then makes sense that a subdivided method be added to the existing triangular surface mesh. That way, subdivision can be performed with:
ja: すべての機能を失わず単純化することはできませんが，多くのオブジェクトは単純化できます．たとえば，VTKの三角形のサーフェイスメッシュは分割できますが，VTKの他のすべてのオブジェクトは分割できません．この場合，既存の三角形表面メッシュに細分化された方法を追加することは理にかなっています．このように，サブディビジョンは次のように実行できます:
uk: Хоча не все можна спростити без втрати функціональності, багато об’єктів можна. Наприклад, трикутні поверхневі сітки можна підрозділити, але будь-які інші об’єкти в VTK - ні. Тоді має сенс додати підрозділений метод до існуючої трикутної поверхневої сітки. Таким чином, підрозділення можна виконати за допомогою:

source: Additionally, the docstrings for all methods in PyVista are intended to be used within interactive coding sessions. This allows users to use sophisticated processing routines on the fly with immediate access to a description of how to use those methods:
ja: また，PyVistaのすべてのメソッドのdocstringは，インタラクティブなコーディングセッションで使用することを意図しています．これにより，高度な処理ルーチンをその場で使用し，メソッドの使用方法の説明にすぐにアクセスできます．
uk: Крім того, рядки документації для всіх методів в PyVista призначені для використання в інтерактивних сеансах розробки коду. Це дозволяє користувачам використовувати складні процедури обробки на льоту з негайним доступом до опису використання цих методів:
